78/xiaozhi-esp32/main/boards/esp-vocat/esp_vocat.cc
            bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            uint8_t pcb_version = 0;
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.0");
                pcb_version = 0;
            } else {
                ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
                vTaskDelay(pdMS_TO_TICKS(50));
                codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
                if (codec_alive) {
                    ESP_LOGI(TAG, "PCB version V1.2");
                    pcb_version = 1;
                    AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                    AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                    QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                    TOUCH_PAD2 = TOUCH_PAD2_2;
                    UART1_TX = UART1_TX_2;
                    UART1_RX = UART1_RX_2;
                } else {
                    ESP_LOGE(TAG, "PCB version detection error");
                }
            }
            return pcb_version;
        }

    static void touch_isr_callback(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad != nullptr) {
            touchpad->NotifyTouchEvent();
        }
    }

    static void touch_event_task(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad == nullptr) {
            ESP_LOGE(TAG, "Invalid touchpad pointer in touch_event_task");
            vTaskDelete(NULL);
            return;
        }

        while (true) {
            if (touchpad->WaitForTouchEvent()) {
                auto &app = Application::GetInstance();
                auto &board = (EspVocat &)Board::GetInstance();

                ESP_LOGD(TAG, "Touch event, TP_PIN_NUM_INT: %d", gpio_get_level(TP_PIN_NUM_INT));
                touchpad->UpdateTouchPoint();
                auto touch_event = touchpad->CheckTouchEvent();

                if (touch_event == Cst816s::TOUCH_RELEASE) {
                    if (app.GetDeviceState() == kDeviceStateStarting) {
                        board.EnterWifiConfigMode();
                    } else {
                        app.ToggleChatState();
                    }
                }
            }
        }
    }

    void InitializeCharge()
    {
        charge_ = new Charge(i2c_bus_, 0x55);
        xTaskCreatePinnedToCore(Charge::TaskFunction, "batterydecTask", 3 * 1024, charge_, 6, &charge_task_handle_, 0);
    }

    void InitializeCst816sTouchPad()
    {
        cst816s_ = new Cst816s(i2c_bus_, 0x15);

        xTaskCreatePinnedToCore(touch_event_task, "touch_task", 4 * 1024, cst816s_, 5, &touch_task_handle_, 1);

        const gpio_config_t int_gpio_config = {
            .pin_bit_mask = (1ULL << TP_PIN_NUM_INT),
            .mode = GPIO_MODE_INPUT,
            // .intr_type = GPIO_INTR_NEGEDGE
            .intr_type = GPIO_INTR_ANYEDGE
        };
        gpio_config(&int_gpio_config);
        gpio_install_isr_service(0);
        gpio_intr_enable(TP_PIN_NUM_INT);
        gpio_isr_handler_add(TP_PIN_NUM_INT, EspVocat::touch_isr_callback, cst816s_);
    }

    void InitializeBmi270()
    {
        esp_err_t imu_ret = Bmi270Motion::Initialize(shared_i2c_bus_handle_);
        if (imu_ret == ESP_OK) {
            bmi270_ready_ = true;
            xTaskCreatePinnedToCore(imu_event_task, "imu_task", 4 * 1024, this, 4, &imu_task_handle_, 1);
        } else {
            ESP_LOGW(TAG, "BMI270 unavailable, shake emotion disabled");
        }
    }

#if CONFIG_IDF_TARGET_ESP32S3
    
    static uint32_t TouchChannelFromPadGpio(gpio_num_t gpio)
    {
        if (gpio == GPIO_NUM_NC) {
            return 0;
        }
        if (gpio >= GPIO_NUM_1 && gpio <= GPIO_NUM_14) {
            return static_cast<uint32_t>(gpio);
        }
        return 0;
    }

    static void touch_slider_event_callback(touch_slider_handle_t handle, touch_slider_event_t event, int32_t data, void* cb_arg)
    {
        (void)handle;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }
        if (event != TOUCH_SLIDER_EVENT_POSITION) {
            ESP_LOGI(TAG, "Touch slider evt=%d data=%" PRId32, static_cast<int>(event), data);
        }

        bool gesture = false;
        if (event == TOUCH_SLIDER_EVENT_LEFT_SWIPE || event == TOUCH_SLIDER_EVENT_RIGHT_SWIPE) {
            gesture = true;
        } else if (event == TOUCH_SLIDER_EVENT_RELEASE) {
            gesture = true;
        }

        if (!gesture) {
            return;
        }

        static int64_t s_last_emotion_us = 0;
        constexpr int64_t kEmotionCooldownUs = 1200000;
        const int64_t now_us = esp_timer_get_time();
        if ((now_us - s_last_emotion_us) < kEmotionCooldownUs) {
            return;
        }
        s_last_emotion_us = now_us;

        self->ShowTemporaryEmotion("happy", 2000);
    }

    static void touch_slider_poll_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr && self->touch_slider_handle_ != nullptr) {
                touch_slider_sensor_handle_events(self->touch_slider_handle_);
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
    }

    void InitializeTouchSlider()
    {
        if (TOUCH_PAD1 == GPIO_NUM_NC || TOUCH_PAD2 == GPIO_NUM_NC) {
            ESP_LOGW(TAG, "Touch slider disabled: TOUCH_PAD1/TOUCH_PAD2 not connected (e.g. PCB v1.0)");
            return;
        }

        const uint32_t ch1 = TouchChannelFromPadGpio(TOUCH_PAD1);
        const uint32_t ch2 = TouchChannelFromPadGpio(TOUCH_PAD2);
        if (ch1 == 0 || ch2 == 0) {
            ESP_LOGW(TAG, "Touch slider: GPIO %d / %d are not touch channels on ESP32-S3 (expect GPIO1..GPIO14)",
                     (int)TOUCH_PAD1, (int)TOUCH_PAD2);
            return;
        }

        static uint32_t channel_list[2];
        static float channel_threshold[2];
        channel_list[0] = ch1;
        channel_list[1] = ch2;
        // 0.02f было слишком грубо: слабый канал (часто GPIO7 / pad1) не входил в touch, свайп не считался.
        channel_threshold[0] = 0.004f;
        channel_threshold[1] = 0.006f;

        touch_slider_config_t cfg = {
            .channel_num = 2,
            .channel_list = channel_list,
            .channel_threshold = channel_threshold,
            .channel_gold_value = nullptr,
            .debounce_times = 1,
            .filter_reset_times = 5,
            .position_range = 10000,
            .calculate_window = 2,
            .swipe_threshold = 28.f,
            .swipe_hysterisis = 22.f,
            .swipe_alpha = 0.9f,
            .skip_lowlevel_init = false,
        };
        esp_err_t err = touch_slider_sensor_create(&cfg, &touch_slider_handle_, touch_slider_event_callback, this);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "touch_slider_sensor_create failed: %s", esp_err_to_name(err));
            touch_slider_handle_ = nullptr;
            return;
        }
        xTaskCreatePinnedToCore(touch_slider_poll_task, "touch_sld", 3072, this, 3, &touch_slider_task_handle_, 1);
        ESP_LOGI(TAG, "Touch slider: TOUCH_PAD1(GPIO%d ch%u), TOUCH_PAD2(GPIO%d ch%u)",
                 (int)TOUCH_PAD1, (unsigned)channel_list[0], (int)TOUCH_PAD2, (unsigned)channel_list[1]);
    }
#endif

